{
  "about": {
    "introduction": "Hello there! Thank you for visiting my personal website. I'm Rashid Visda, a Computer Science student currently studying at the City College of Calamba.",
    "summary": "I'm a  Full stack developer who enjoys building clean, responsive, and user-friendly web interfaces. My main focus is on modern frontend technologies such as React, Next.js, and Tailwind CSS. I enjoy turning ideas into functional, visually engaging digital experiences that bring real value to users.",
    "mindset": "I value simplicity, collaboration, and continuous learning. I believe that great design and solid code go hand in hand in crafting impactful digital products. As a fast learner, I adapt quickly to new tools and technologies and always aim to improve my craft.",
    "closing": "I’m currently freelancing as a Frontend Developer and open to exciting opportunities to grow as a full-stack web developer in the near future.",
    "signature": "Rashid Visda"
  },
  "career": {
    "experiences": [
      {
        "company": "Freelance",
        "role": "Frontend Developer",
        "location": "Philippines",
        "logo": "/icons/fiverr.svg",
        "start_date": "Jan 2025",
        "end_date": "Present",
        "duration": "Ongoing",
        "type": "Freelance",
        "work_mode": "Remote",
        "responsibilities": [
          "Develop responsive and visually appealing websites using React, Next.js, and Tailwind CSS.",
          "Collaborate with clients to transform design concepts into functional web interfaces.",
          "Focus on performance optimization and accessibility to enhance user experience.",
          "Continuously learn new frontend technologies and follow best coding practices."
        ]
      }
    ]
  },
  "education": {
    "records": [
      {
        "school": "City College of Calamba",
        "degree": "Bachelor’s degree",
        "field": "Computer Science",
        "start_year": 2025,
        "end_year": "Present",
        "logo": "/icons/ccc-icon.png",
        "location": "Calamba, Philippines"
      },
      {
        "school": "Holy Angel University",
        "degree": "Bachelor’s degree (Undergraduate Year)",
        "field": "Computer Science",
        "start_year": 2023,
        "end_year": 2024,
        "logo": "/icons/hau-icon.png",
        "location": "Angeles, Philippines"
      }
    ]
  }
}
